fuzz/mutations/anthropic-maxtokens-budget.patch
diff --git a/llm/providers/anthropic/request.go b/llm/providers/anthropic/request.go
index bc8979ea90..f2b08d1ac9 100644
--- a/llm/providers/anthropic/request.go
+++ b/llm/providers/anthropic/request.go
@@ -109,9 +109,7 @@ func reconcileThinkingContract(body map[string]any, req llm.Request, res registr
 	requestutil.ReconcileOutputField(body, "max_tokens", req.MaxTokens, res.Caps.MaxOutputTokens)
 	if thinkingBudget > 0 {
 		mt := intFromAny(body["max_tokens"])
-		if mt <= thinkingBudget {
-			return anthropicThinkingBudgetError(req, res, thinkingBudget+1, mt)
-		}
+		_ = mt
 	}
 	if invariant.Enabled {
 		// When the final body carries a positive thinking budget, Anthropic rejects
