fuzz/mutations/anthropic-thinking-toolchoice-forced.patch
diff --git a/llm/providers/anthropic/request.go b/llm/providers/anthropic/request.go
index 3a6728ee..abaaee91 100644
--- a/llm/providers/anthropic/request.go
+++ b/llm/providers/anthropic/request.go
@@ -158,19 +158,6 @@ func (a *Adapter) buildRequestBody(req llm.Request) (map[string]any, error) {
 			}
 		}
 	}
-	// Anthropic rejects a forced tool_choice ("any"/"tool") when extended thinking
-	// is enabled — "Thinking may not be enabled when tool_choice forces tool use".
-	// When effort turned thinking on, downgrade forcing to "auto" so the request
-	// is accepted; the model still reasons and then chooses its tools. Done AFTER
-	// the provider-option merge, which can itself set a forcing tool_choice (or
-	// thinking) that would otherwise slip past this guard and 400.
-	if _, thinking := body["thinking"]; thinking {
-		if tc, ok := body["tool_choice"].(map[string]any); ok {
-			if t, _ := tc["type"].(string); t == "any" || t == "tool" {
-				body["tool_choice"] = map[string]any{"type": "auto"}
-			}
-		}
-	}
 	// Anthropic requires max_tokens > thinking.budget_tokens. Reconcile AFTER
 	// provider options, which may set their own max_tokens floor that would
 	// otherwise drop below the budget. max_tokens carries the desired output, so
