fuzz/mutations/anthropic-thinking-toolchoice-forced.patch
diff --git a/llm/providers/anthropic/request.go b/llm/providers/anthropic/request.go
index bc8979ea90..eaf335f7c9 100644
--- a/llm/providers/anthropic/request.go
+++ b/llm/providers/anthropic/request.go
@@ -92,13 +92,6 @@ func applyAnthropicTools(body map[string]any, req llm.Request, webSearch bool) e
 // normalizeThinkingToolChoice applies the tool-choice restriction shared by
 // completion and token-count requests whenever thinking is active.
 func normalizeThinkingToolChoice(body map[string]any) {
-	if finalThinkingActive(body) {
-		if tc, ok := body["tool_choice"].(map[string]any); ok {
-			if t, _ := tc["type"].(string); t == "any" || t == "tool" {
-				body["tool_choice"] = map[string]any{"type": "auto"}
-			}
-		}
-	}
 }
 
 // reconcileThinkingContract enforces the completion-only Anthropic request
