fuzz/mutations/anthropic-thinking-toolchoice-forced.patch
diff --git a/llm/providers/anthropic/request.go b/llm/providers/anthropic/request.go
index bc8979ea90..69163b6c8a 100644
--- a/llm/providers/anthropic/request.go
+++ b/llm/providers/anthropic/request.go
@@ -92,19 +92,11 @@ func applyAnthropicTools(body map[string]any, req llm.Request, webSearch bool) e
 // normalizeThinkingToolChoice applies the tool-choice restriction shared by
 // completion and token-count requests whenever thinking is active.
 func normalizeThinkingToolChoice(body map[string]any) {
-	if finalThinkingActive(body) {
-		if tc, ok := body["tool_choice"].(map[string]any); ok {
-			if t, _ := tc["type"].(string); t == "any" || t == "tool" {
-				body["tool_choice"] = map[string]any{"type": "auto"}
-			}
-		}
-	}
 }
 
 // reconcileThinkingContract enforces the completion-only Anthropic request
 // contracts that depend on the FINAL overlaid body state.
 func reconcileThinkingContract(body map[string]any, req llm.Request, res registry.Resolved) error {
-	normalizeThinkingToolChoice(body)
 	thinkingBudget := finalThinkingBudget(body)
 	requestutil.ReconcileOutputField(body, "max_tokens", req.MaxTokens, res.Caps.MaxOutputTokens)
 	if thinkingBudget > 0 {
