fuzz/mutations/jobstore-terminal-overwrite.patch
diff --git a/agent/internal/jobstore/fold.go b/agent/internal/jobstore/fold.go
index 9d51f563ed..de1e4d5007 100644
--- a/agent/internal/jobstore/fold.go
+++ b/agent/internal/jobstore/fold.go
@@ -203,10 +203,6 @@ func applyEvent(r *JobRecord, e Event) {
 			r.Status = StatusRunning
 		}
 	case EventJobFinished:
-		// First terminal write wins; later ones are duplicates/reconstructions.
-		if r.Status.IsTerminal() {
-			return
-		}
 		r.Status = e.Status
 		r.Reason = e.Reason
 		r.ExhaustionBudget = e.ExhaustionBudget
