fuzz/mutations/toolsummary-taskupdate-panic.patch
diff --git a/cmd/evener-tui/internal/toolsummary/tool_summary.go b/cmd/evener-tui/internal/toolsummary/tool_summary.go
index b1d46d84..53722f93 100644
--- a/cmd/evener-tui/internal/toolsummary/tool_summary.go
+++ b/cmd/evener-tui/internal/toolsummary/tool_summary.go
@@ -325,7 +325,7 @@ func renderTaskUpdate(updates []any) string {
 		if m == nil {
 			continue
 		}
-		idF, _ := m["id"].(float64)
+		idF := m["id"].(float64)
 		id := int(idF)
 		status, _ := m["status"].(string)
 		icon := statusIcon[status]
